#### DuctFittingAndAccessoryPressureDropItem Members

---

|  |
| --- |
| DuctFittingAndAccessoryPressureDropItem Class   Methods   Properties   See Also |

The  DuctFittingAndAccessoryPressureDropItem  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  DuctFittingAndAccessoryPressureDropItem |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BeginConnectorIndex | The index of the begin connector of the flow path. |
| Public property | Coefficient | The coefficient between the begin connector and end connector, Units: (kg/(ftÂ·sÂ²)). |
| Public property | EndConnectorIndex | The index of the end conector of the flow path. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | VelocityPressure | The velocity pressure, for converting between coefficient and pressure drop on this flow path. Units: (kg/(ftÂ·sÂ²)). |

# See Also

DuctFittingAndAccessoryPressureDropItem Class

Autodesk.Revit.DB.Mechanical Namespace